# Basic Manipulation Using Pandas Library

<font size=4> By Lexie

# Pandas

In this section of the course we will learn how to use pandas for data analysis.

# Panda Series

In [99]:
# Import required libraries
import numpy as np
import pandas as pd

## Creating a Series

One can convert a list,numpy array, or dictionary to a Series:

In [100]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

**Using Lists**

In [101]:
series_1 = pd.Series(data=my_list)
type(series_1),series_1

(pandas.core.series.Series,
 0    10
 1    20
 2    30
 dtype: int64)

In [102]:
series_2 =pd.Series(data=my_list,index=labels)
series_2

a    10
b    20
c    30
dtype: int64

In [103]:
series_2["a"]

10

In [104]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

** NumPy Arrays **

In [105]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [106]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

**Dictionary**

In [107]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

## Data in a Series

A pandas Series can hold a variety of object types:

In [108]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [109]:
# Even functions (although unlikely that you will use this)
pd.Series([sum,len])

0    <built-in function sum>
1    <built-in function len>
dtype: object

## Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

In [110]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [111]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [112]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [113]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [114]:
ser1['USA']

1

In [115]:
ser1*ser2

Germany     4.0
Italy       NaN
Japan      16.0
USA         1.0
USSR        NaN
dtype: float64

In [116]:
ser3 = pd.Series([1,2,3,4])  
ser4 = pd.Series([1,2,5,4])  
ser3+ser4

0    2
1    4
2    8
3    8
dtype: int64

# Dataframe


- A two-dimensional table of data with column and row indexes
- The columns are made up of pandas series objects

In [117]:
from numpy.random import randn
np.random.seed(111)

In [118]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [119]:
df.shape

(5, 4)

## Selection and Indexing

Grabbing data from a DataFrame

In [120]:
df['W']

A   -1.133838
B   -0.787534
C   -0.735523
D   -1.440585
E    0.492003
Name: W, dtype: float64

In [121]:
# Pass a list of column names
df[['Z','W', "Y"]]

          Z         W         Y
A -0.355382 -1.133838  1.496554
B -0.354174 -0.787534 -0.059169
C -0.589920 -0.735523  0.238894
D -0.090986 -1.440585 -1.027967
E  0.315986  0.492003  1.283049

In [122]:
# or the SQL Syntax
df.W

A   -1.133838
B   -0.787534
C   -0.735523
D   -1.440585
E    0.492003
Name: W, dtype: float64

In [123]:
type(df[['W',"X"]])

pandas.core.frame.DataFrame

**Creating a new column:**

In [124]:
df['new'] = df['W'] + df['Y']
df.head()

          W         X         Y         Z       new
A -1.133838  0.384319  1.496554 -0.355382  0.362715
B -0.787534 -0.459439 -0.059169 -0.354174 -0.846702
C -0.735523 -1.183940  0.238894 -0.589920 -0.496629
D -1.440585  0.773703 -1.027967 -0.090986 -2.468552
E  0.492003  0.424672  1.283049  0.315986  1.775052

In [125]:
df["new_2"]= pd.Series([1,3,5,7,9], index=["A","B","C","D","E"])
df

          W         X         Y         Z       new  new_2
A -1.133838  0.384319  1.496554 -0.355382  0.362715      1
B -0.787534 -0.459439 -0.059169 -0.354174 -0.846702      3
C -0.735523 -1.183940  0.238894 -0.589920 -0.496629      5
D -1.440585  0.773703 -1.027967 -0.090986 -2.468552      7
E  0.492003  0.424672  1.283049  0.315986  1.775052      9

**Removing Columns**

In [126]:
df.drop('new', axis=1)

          W         X         Y         Z  new_2
A -1.133838  0.384319  1.496554 -0.355382      1
B -0.787534 -0.459439 -0.059169 -0.354174      3
C -0.735523 -1.183940  0.238894 -0.589920      5
D -1.440585  0.773703 -1.027967 -0.090986      7
E  0.492003  0.424672  1.283049  0.315986      9

In [127]:
# Not inplace unless specified!
df

          W         X         Y         Z       new  new_2
A -1.133838  0.384319  1.496554 -0.355382  0.362715      1
B -0.787534 -0.459439 -0.059169 -0.354174 -0.846702      3
C -0.735523 -1.183940  0.238894 -0.589920 -0.496629      5
D -1.440585  0.773703 -1.027967 -0.090986 -2.468552      7
E  0.492003  0.424672  1.283049  0.315986  1.775052      9

In [128]:
df.drop(['new'],axis=1,inplace=True)
df

          W         X         Y         Z  new_2
A -1.133838  0.384319  1.496554 -0.355382      1
B -0.787534 -0.459439 -0.059169 -0.354174      3
C -0.735523 -1.183940  0.238894 -0.589920      5
D -1.440585  0.773703 -1.027967 -0.090986      7
E  0.492003  0.424672  1.283049  0.315986      9

In [130]:
#Can also drop rows
df1=df.drop('E',axis=0)
df1

          W         X         Y         Z  new_2
A -1.133838  0.384319  1.496554 -0.355382      1
B -0.787534 -0.459439 -0.059169 -0.354174      3
C -0.735523 -1.183940  0.238894 -0.589920      5
D -1.440585  0.773703 -1.027967 -0.090986      7

<font size=3.5 color=blue> **Selecting Rows**

* Selecting data by row numbers (.iloc)
* Selecting data by label or by a conditional statment (.loc)
* Selecting in a hybrid approach (.ix) (now Deprecated in Pandas 0.20.1)

Select based off of position

In [131]:
df.iloc[2]

W       -0.735523
X       -1.183940
Y        0.238894
Z       -0.589920
new_2    5.000000
Name: C, dtype: float64

In [132]:
# Single selections using iloc and DataFrame
# Rows:
df.iloc[0] # first row of data frame 
df.iloc[1] # second row of data frame 
df.iloc[-1] # last row of data frame 
# Columns:
df.iloc[:,0] # first column of data frame 
df.iloc[:,1] # second column of data frame 
df.iloc[:,-1] # last column of data frame

A    1
B    3
C    5
D    7
E    9
Name: new_2, dtype: int64

In [133]:
# Multiple row and column selections using iloc and DataFrame
df.iloc[0:3] # first three rows of dataframe
df.iloc[:, 0:2] # first two columns of data frame with all rows
df.iloc[[0,3], [0,1,2]] # 1st, 4th row + 1st 2nd 3rd columns.
df.iloc[0:2, 0:2] # first two rows and two columns of data frame

          W         X
A -1.133838  0.384319
B -0.787534 -0.459439

<font size=3.5 color=blue>**Select based on label (.loc)**

The Pandas loc indexer can be used with DataFrames for two different use cases:

* Selecting rows by label/index
* Selecting rows with a boolean / conditional lookup

The loc indexer is used with the same syntax as iloc: data.loc[[row selection], [column selection]] .

In [134]:
df.loc['A']

W       -1.133838
X        0.384319
Y        1.496554
Z       -0.355382
new_2    1.000000
Name: A, dtype: float64

In [135]:
df.loc[['A', 'C']]

          W         X         Y         Z  new_2
A -1.133838  0.384319  1.496554 -0.355382      1
C -0.735523 -1.183940  0.238894 -0.589920      5

<font size=3 color=blue>Selecting subset of rows and columns

In [136]:
df.loc[['A', 'C'], ["W", "Y"]]

          W         Y
A -1.133838  1.496554
C -0.735523  0.238894

In [137]:
df.loc['B','Y']

-0.05916877147496081

In [138]:
df_1 = df.loc[['A','B'],['W','Y']]
df_1

          W         Y
A -1.133838  1.496554
B -0.787534 -0.059169

Selecting rows with a boolean / conditional lookup

In [139]:
df[df.Y>0].W

A   -1.133838
C   -0.735523
E    0.492003
Name: W, dtype: float64

In [140]:
df["Y"]>0

A     True
B    False
C     True
D    False
E     True
Name: Y, dtype: bool

In [141]:
df.loc[df["Y"]>0]

          W         X         Y         Z  new_2
A -1.133838  0.384319  1.496554 -0.355382      1
C -0.735523 -1.183940  0.238894 -0.589920      5
E  0.492003  0.424672  1.283049  0.315986      9

In [142]:
df["new_2"] = pd.Series([1,3,5,7,9], index = "A B C D E".split(" "))


df.loc[df["new_2"].isin([1, 5])]

          W         X         Y         Z  new_2
A -1.133838  0.384319  1.496554 -0.355382      1
C -0.735523 -1.183940  0.238894 -0.589920      5

In [143]:
df.loc[df["new_2"] == 1] 
df[df["new_2"] == 1] 
df[(df.new_2 >2) | (df.X >0)]

          W         X         Y         Z  new_2
A -1.133838  0.384319  1.496554 -0.355382      1
B -0.787534 -0.459439 -0.059169 -0.354174      3
C -0.735523 -1.183940  0.238894 -0.589920      5
D -1.440585  0.773703 -1.027967 -0.090986      7
E  0.492003  0.424672  1.283049  0.315986      9

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [144]:
df

          W         X         Y         Z  new_2
A -1.133838  0.384319  1.496554 -0.355382      1
B -0.787534 -0.459439 -0.059169 -0.354174      3
C -0.735523 -1.183940  0.238894 -0.589920      5
D -1.440585  0.773703 -1.027967 -0.090986      7
E  0.492003  0.424672  1.283049  0.315986      9

In [145]:
df>0

       W      X      Y      Z  new_2
A  False   True   True  False   True
B  False  False  False  False   True
C  False  False   True  False   True
D  False   True  False  False   True
E   True   True   True   True   True

In [146]:
df[df.Y>0]["W"]

A   -1.133838
C   -0.735523
E    0.492003
Name: W, dtype: float64

In [147]:
df[df['Y']>0]

          W         X         Y         Z  new_2
A -1.133838  0.384319  1.496554 -0.355382      1
C -0.735523 -1.183940  0.238894 -0.589920      5
E  0.492003  0.424672  1.283049  0.315986      9

In [148]:
df[df['W']>0]['Y']

E    1.283049
Name: Y, dtype: float64

In [149]:
df[df['Y']>0][['Y','Z']]

          Y         Z
A  1.496554 -0.355382
C  0.238894 -0.589920
E  1.283049  0.315986

<font color=blue size=3.5>For two conditions we can use | and & with parenthesis:

In [150]:
df[(df['W']<0) | (df['Y'] > 0)]

          W         X         Y         Z  new_2
A -1.133838  0.384319  1.496554 -0.355382      1
B -0.787534 -0.459439 -0.059169 -0.354174      3
C -0.735523 -1.183940  0.238894 -0.589920      5
D -1.440585  0.773703 -1.027967 -0.090986      7
E  0.492003  0.424672  1.283049  0.315986      9

## More Index Details

In [151]:
df

          W         X         Y         Z  new_2
A -1.133838  0.384319  1.496554 -0.355382      1
B -0.787534 -0.459439 -0.059169 -0.354174      3
C -0.735523 -1.183940  0.238894 -0.589920      5
D -1.440585  0.773703 -1.027967 -0.090986      7
E  0.492003  0.424672  1.283049  0.315986      9

In [152]:
# Reset to default 0,1...n index
df.reset_index()
df

          W         X         Y         Z  new_2
A -1.133838  0.384319  1.496554 -0.355382      1
B -0.787534 -0.459439 -0.059169 -0.354174      3
C -0.735523 -1.183940  0.238894 -0.589920      5
D -1.440585  0.773703 -1.027967 -0.090986      7
E  0.492003  0.424672  1.283049  0.315986      9

In [153]:
newind = 'CA NY WY OR MA'.split()

In [154]:
df['States'] = newind
df

          W         X         Y         Z  new_2 States
A -1.133838  0.384319  1.496554 -0.355382      1     CA
B -0.787534 -0.459439 -0.059169 -0.354174      3     NY
C -0.735523 -1.183940  0.238894 -0.589920      5     WY
D -1.440585  0.773703 -1.027967 -0.090986      7     OR
E  0.492003  0.424672  1.283049  0.315986      9     MA

In [155]:
df.set_index('States')

               W         X         Y         Z  new_2
States
CA     -1.133838  0.384319  1.496554 -0.355382      1
NY     -0.787534 -0.459439 -0.059169 -0.354174      3
WY     -0.735523 -1.183940  0.238894 -0.589920      5
OR     -1.440585  0.773703 -1.027967 -0.090986      7
MA      0.492003  0.424672  1.283049  0.315986      9

In [156]:
df

          W         X         Y         Z  new_2 States
A -1.133838  0.384319  1.496554 -0.355382      1     CA
B -0.787534 -0.459439 -0.059169 -0.354174      3     NY
C -0.735523 -1.183940  0.238894 -0.589920      5     WY
D -1.440585  0.773703 -1.027967 -0.090986      7     OR
E  0.492003  0.424672  1.283049  0.315986      9     MA

In [157]:
df = df.reset_index()
df.set_index('States',inplace=True)
df

       index         W         X         Y         Z  new_2
States
CA         A -1.133838  0.384319  1.496554 -0.355382      1
NY         B -0.787534 -0.459439 -0.059169 -0.354174      3
WY         C -0.735523 -1.183940  0.238894 -0.589920      5
OR         D -1.440585  0.773703 -1.027967 -0.090986      7
MA         E  0.492003  0.424672  1.283049  0.315986      9

## Multi-Index and Index Hierarchy

In [158]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) #create an interator over two lists and then convert to a list
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [159]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [160]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -0.408082 -0.067948
   2 -0.952427 -0.110677
   3  0.570594  0.915420
G2 1 -1.669341  0.482714
   2 -0.310473  2.394690
   3  1.550931 -0.646465

For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [161]:
df.loc['G1']

          A         B
1 -0.408082 -0.067948
2 -0.952427 -0.110677
3  0.570594  0.915420

In [162]:
df.loc['G1'].loc[1]

A   -0.408082
B   -0.067948
Name: 1, dtype: float64

In [163]:
df.index.names

FrozenList([None, None])

In [164]:
df.index.names = ['Group','Num']
df

                  A         B
Group Num
G1    1   -0.408082 -0.067948
      2   -0.952427 -0.110677
      3    0.570594  0.915420
G2    1   -1.669341  0.482714
      2   -0.310473  2.394690
      3    1.550931 -0.646465

In [165]:
df.xs('G1')

            A         B
Num
1   -0.408082 -0.067948
2   -0.952427 -0.110677
3    0.570594  0.915420

In [166]:
df.xs(['G1',1])

A   -0.408082
B   -0.067948
Name: (G1, 1), dtype: float64

In [167]:
df.xs(1,level='Num')

              A         B
Group
G1    -0.408082 -0.067948
G2    -1.669341  0.482714

# Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating.

In [168]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [169]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [170]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

In [171]:
pd.concat([df1,df2,df3], axis =1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [172]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Merging

In [173]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [174]:
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})  
right
#pd.concat([left,right], axis=1)

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [175]:
pd.merge(left,right,how='right', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [176]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [177]:
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [178]:
pd.merge(left, right, how="right", on=['key1'])

  key1 key2_x   A   B key2_y   C   D
0   K0     K0  A0  B0     K0  C0  D0
1   K0     K1  A1  B1     K0  C0  D0
2   K1     K0  A2  B2     K0  C1  D1
3   K1     K0  A2  B2     K0  C2  D2
4   K2     K1  A3  B3     K0  C3  D3

In [179]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [180]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

## Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [181]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [182]:
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [183]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [184]:
left.join(right, how='right')

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

## The MovieLens data

http://grouplens.org/datasets/movielens/


Example inspired by Greg Reda

# Read the user data

In [186]:
import numpy as np
import pandas as pd
import matplotlib
import matplotlib.pyplot as plt
%matplotlib inline

In [187]:
# pass in column names for each CSV
u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']

users = pd.read_csv(
    'http://files.grouplens.org/datasets/movielens/ml-100k/u.user', 
    sep='|', names=u_cols, encoding = "latin") #read a csv file

users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

# Read the ratings

In [188]:
r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
ratings = pd.read_csv(
    'http://files.grouplens.org/datasets/movielens/ml-100k/u.data', 
    sep='\t', names=r_cols, encoding = "latin")

ratings.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

# Now data about the movies

In [189]:
# the movies file contains columns indicating the movie's genres
# let's only load the first five columns of the file with usecols
m_cols = ['movie_id', 'title', 'release_date', 
            'video_release_date', 'imdb_url']

movies = pd.read_csv(
    'http://files.grouplens.org/datasets/movielens/ml-100k/u.item', 
    sep='|', names=m_cols, usecols=range(5), encoding = "latin")

#movies.to_csv('movies.csv')
movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

# Get information about data

In [190]:
print(movies.dtypes)
print(movies.describe())
print(ratings.describe())

movie_id                int64
title                  object
release_date           object
video_release_date    float64
imdb_url               object
dtype: object
          movie_id  video_release_date
count  1682.000000                 0.0
mean    841.500000                 NaN
std     485.695893                 NaN
min       1.000000                 NaN
25%     421.250000                 NaN
50%     841.500000                 NaN
75%    1261.750000                 NaN
max    1682.000000                 NaN
            user_id       movie_id         rating  unix_timestamp
count  100000.00000  100000.000000  100000.000000    1.000000e+05
mean      462.48475     425.530130       3.529860    8.835289e+08
std       266.61442     330.798356       1.125674    5.343856e+06
min         1.00000       1.000000       1.000000    8.747247e+08
25%       254.00000     175.000000       3.000000    8.794487e+08
50%       447.00000     322.000000       4.000000    8.828269e+08
75%       682.00000     631.000000       4.000000    8.882600e+08
max       943.00000    1682.000000       5.000000    8.932866e+08

# Selecting data

- DataFrame => group of Series with shared index
- Single DataFrame column => Series

In [192]:
users.head()
users[["age", "sex"]]

     age sex
0     24   M
1     53   F
2     23   M
3     24   M
4     33   F
..   ...  ..
938   26   F
939   32   M
940   20   M
941   48   F
942   22   M

[943 rows x 2 columns]

In [193]:
#select columns
users['occupation'].head()
users.occupation.head()

0    technician
1         other
2        writer
3    technician
4         other
Name: occupation, dtype: object

In [194]:
## *** Where did the nice design go? ***
columns_you_want = ['occupation', 'sex'] 
users[columns_you_want].head()

   occupation sex
0  technician   M
1       other   F
2      writer   M
3  technician   M
4       other   F

In [195]:
print(users.iloc[3:5])

   user_id  age sex  occupation zip_code
3        4   24   M  technician    43537
4        5   33   F       other    15213

# Filtering data

Select users older than 25

In [196]:
oldUsers = users[users.age > 25]
oldUsers.head()

   user_id  age sex     occupation zip_code
1        2   53   F          other    94043
4        5   33   F          other    15213
5        6   42   M      executive    98101
6        7   57   M  administrator    91344
7        8   36   M  administrator    05201

- show users aged 40 and male
- show the mean age of female programmers

In [197]:
# users aged 40 AND male
# your code here
users[(users.age==40) & (users.sex=='M')]

     user_id  age sex  occupation zip_code
18        19   40   M   librarian    02138
82        83   40   M       other    44133
115      116   40   M  healthcare    97232
199      200   40   M  programmer    93402
283      284   40   M   executive    92629
289      290   40   M    engineer    93550
308      309   40   M   scientist    70802
357      358   40   M    educator    10022
397      398   40   M       other    60008
564      565   40   M     student    55422
646      647   40   M    educator    45810
791      792   40   M  programmer    12205
841      842   40   M      writer    93055
917      918   40   M   scientist    70116

In [198]:
## users who are female and programmers
users[(users.sex=='F') & (users.occupation=='programmer')]

     user_id  age sex  occupation zip_code
291      292   35   F  programmer    94703
299      300   26   F  programmer    55106
351      352   37   F  programmer    55105
403      404   29   F  programmer    55108
420      421   38   F  programmer    55105
697      698   28   F  programmer    06906

In [199]:
## show statistic summary or compute mean
users.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

# Split-apply-combine

- splitting the data into groups based on some criteria

- applying a function to each group independently

- combining the results into a data structure

In [200]:
#group based off of user_id
ratings.groupby("movie_id").rating.mean()

movie_id
1       3.878319
2       3.206107
3       3.033333
4       3.550239
5       3.302326
          ...
1678    1.000000
1679    3.000000
1680    2.000000
1681    3.000000
1682    3.000000
Name: rating, Length: 1682, dtype: float64

In [201]:
# save this object as a new variable
grouped = ratings.groupby("user_id")

call aggregate methods off the object:

In [202]:
grouped.rating.describe()
#grouped.min()
#grouped.max()
#grouped.std()
#grouped.count()
#grouped.describe()

         count      mean       std  min  25%  50%  75%  max
user_id
1        272.0  3.610294  1.263585  1.0  3.0  4.0  5.0  5.0
2         62.0  3.709677  1.030472  1.0  3.0  4.0  4.0  5.0
3         54.0  2.796296  1.219026  1.0  2.0  3.0  4.0  5.0
4         24.0  4.333333  0.916831  2.0  4.0  5.0  5.0  5.0
5        175.0  2.874286  1.362963  1.0  2.0  3.0  4.0  5.0
...        ...       ...       ...  ...  ...  ...  ...  ...
939       49.0  4.265306  0.974156  2.0  4.0  5.0  5.0  5.0
940      107.0  3.457944  1.012007  1.0  3.0  4.0  4.0  5.0
941       22.0  4.045455  0.898532  2.0  4.0  4.0  5.0  5.0
942       79.0  4.265823  0.763072  2.0  4.0  4.0  5.0  5.0
943      168.0  3.410714  1.258886  1.0  2.0  4.0  4.0  5.0

[943 rows x 8 columns]

# Split-apply-combine

<img src='images/split_apply.png'>

# Find Diligent Users

- split data per user ID
- count ratings
- combine result

In [12]:
#print(ratings.head())
## split data
ratings.groupby("user_id").count().idxmax()

ratings.groupby("user_id").count().sort_values(by="rating")
## count and combine

         movie_id  rating  unix_timestamp
user_id
202            20      20              20
441            20      20              20
685            20      20              20
34             20      20              20
36             20      20              20
...           ...     ...             ...
276           518     518             518
450           540     540             540
13            636     636             636
655           685     685             685
405           737     737             737

[943 rows x 3 columns]

- get the average rating per movie
- advanced: get the movie titles with the highest average rating

In [204]:
print("Good movie ids:")
avg_ratings=ratings.groupby('movie_id').rating.mean()
avg_ratings=pd.DataFrame(avg_ratings)
print(avg_ratings)

Good movie ids:
            rating
movie_id
1         3.878319
2         3.206107
3         3.033333
4         3.550239
5         3.302326
...            ...
1678      1.000000
1679      3.000000
1680      2.000000
1681      3.000000
1682      3.000000

[1682 rows x 1 columns]

In [40]:
print("Best movie titles")
pd.merge(movies[['movie_id','title']],avg_ratings,on='movie_id')

Best movie titles

      movie_id                                      title    rating
0            1                           Toy Story (1995)  3.878319
1            2                           GoldenEye (1995)  3.206107
2            3                          Four Rooms (1995)  3.033333
3            4                          Get Shorty (1995)  3.550239
4            5                             Copycat (1995)  3.302326
...        ...                                        ...       ...
1677      1678                          Mat' i syn (1997)  1.000000
1678      1679                           B. Monkey (1998)  3.000000
1679      1680                       Sliding Doors (1998)  2.000000
1680      1681                        You So Crazy (1994)  3.000000
1681      1682  Scream of Stone (Schrei aus Stein) (1991)  3.000000

[1682 rows x 3 columns]

# Passing a Function

Anonymous function means that a function is without a name. As we already know that def keyword is used to define the normal functions and the lambda keyword is used to create anonymous functions. It has the following syntax:

<font size=4>**lambda** arguments: expression

In [212]:
average_ratings = grouped.apply(lambda y: y.mean())
average_ratings.head()
#ratings.sort_values(by=["movie_id", "user_id"])
# ratings.rating.apply(np.sqrt)
# movies.title.apply(len)

         user_id    movie_id    rating  unix_timestamp
user_id
1            1.0  136.500000  3.610294    8.773916e+08
2            2.0  249.500000  3.709677    8.886204e+08
3            3.0  318.814815  2.796296    8.892372e+08
4            4.0  291.041667  4.333333    8.920028e+08
5            5.0  291.291429  2.874286    8.762081e+08

In [213]:
movies.title.str.split(" ")
movies.title.str.split(" ").apply(lambda x: x[0])

0             Toy
1       GoldenEye
2            Four
3             Get
4         Copycat
          ...
1677         Mat'
1678           B.
1679      Sliding
1680          You
1681       Scream
Name: title, Length: 1682, dtype: object

- get the number of female and male users

- advanced: list all occupations and if they are male or female dominant

In [208]:
# get the number of female and male users
print('number of male users: ')
users[users.sex=='M'].count().unique()[0]

number of male users:

670

In [209]:
print('number of female users: ')
users[users.sex=='F'].count().unique()[0]

number of female users:

273

In [238]:
# list all occupations and if they are male or female dominant
pd.DataFrame(users.groupby('occupation').sex.apply(lambda x: x.mode()))

                sex
occupation
administrator 0   M
artist        0   M
doctor        0   M
educator      0   M
engineer      0   M
entertainment 0   M
executive     0   M
healthcare    0   F
homemaker     0   F
lawyer        0   M
librarian     0   F
marketing     0   M
none          0   M
other         0   M
programmer    0   M
retired       0   M
salesman      0   M
scientist     0   M
student       0   M
technician    0   M
writer        0   M